#Область ПрограммныйИнтерфейс

// Возвращает структуру состояния MCP.
//
// Возвращаемое значение:
//  Структура - Состояние MCP.
Функция ПолучитьСостояние() Экспорт
	Если Мсп_Состояние = Неопределено Тогда
		Мсп_Состояние = Новый Структура;
	КонецЕсли;
	Возврат Мсп_Состояние;
КонецФункции

// Возвращает значение состояния по имени.
//
// Параметры:
//  Имя - Строка - Имя значения состояния.
//  ЗначениеПоУмолчанию - Произвольный, Неопределено - Значение по умолчанию.
//
// Возвращаемое значение:
//  Произвольный - Значение состояния или значение по умолчанию.
Функция ПолучитьСостояниеЗначение(Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Состояние = ПолучитьСостояние();
	Если Состояние.Свойство(Имя) Тогда
		Возврат Состояние[Имя];
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

// Устанавливает значение состояния.
//
// Параметры:
//  Имя - Строка - Имя значения состояния.
//  Значение - Произвольный - Значение состояния.
Процедура УстановитьСостояниеЗначение(Имя, Значение) Экспорт
	Состояние = ПолучитьСостояние();
	Состояние.Вставить(Имя, Значение);
КонецПроцедуры

#КонецОбласти
