#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Мсп_Сервер.ОтменитьРегистрациюПровайдера(ИмяПровайдера());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьИнструменты(Команда)
	Мсп_Сервер.ЗарегистрироватьИнструмент(Мсп_Сервер.НовыйОписаниеИнструмента(
		"Таймер",
		"Отсчтитывает нужно количество секунд и отправляет ответ с текущим временем",
		СхемаВходныхПараметров(),
		Новый ОписаниеОповещения("ЗапуститьТаймер", ЭтотОбъект),
		ИмяПровайдера()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПанельУправления(Команда)
	ОткрытьФорму("ОбщаяФорма.Мсп_УправлениеMCP");
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСервер(Команда)
	
	Мсп_Сервер.ЗапуститьСервер(9874);
	
КонецПроцедуры

#КонецОбласти

#Область Инструменты

&НаКлиенте
Функция ИмяПровайдера()
	Возврат "Асинхронные операции";
КонецФункции
&НаКлиенте
Функция ЗапуститьТаймер(Запрос, ДополнительныеПараметры) Экспорт
	
КонецФункции

// Возвращает JSON-схему входных параметров запуска.
&НаКлиенте
Функция СхемаВходныхПараметров()
	Свойства = Новый Структура;
	Свойства.Вставить("ticks", Мсп_СхемаПараметров.НовыйСвойствоСхемы("number", "Количество секунд ожидания"));
	Возврат Мсп_СхемаПараметров.НовыйСхемаОбъекта(Свойства);
КонецФункции

#КонецОбласти
