#Область ПрограммныйИнтерфейс

Процедура ЗапуститьСервер(НомерПорта)
	
	ПодключитьКомпоненту();
	
	ЭкземплярКомпонентыHTTP = Новый("AddIn.WebTransport.http");
	АдресПрослушивания =  "127.0.0.1:" + Формат(НомерПорта, "ЧГ=0");
	ЭкземплярКомпонентыHTTP.ЗапуститьHTTP(АдресПрослушивания);
	
КонецПроцедуры

Процедура ОстановитьСервер() Экспорт
	
	ЭкземплярСервера = ЭкземплярСервера();
	
	Если ЭкземплярСервера <> Неопределено Тогда
		ЭкземплярСервера.ОстановитьHTTP();
		ЭкземплярСервера = Неопределено;
	КонецЕсли;
	MCP_SSE_Сессии = Новый Соответствие;
	MCP_Лог("Server stopped");
	
КонецПроцедуры

Асинх Функция ПодключитьКомпоненту() Экспорт
	
	МакетКомпоненты = "ОбщийМакет.webTransport";
	ИмяКомпоненты = "WebTransport";
	
	Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(МакетКомпоненты, ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.НеИзолированно);
	
	Если Не Подключено Тогда
		Ждать УстановитьВнешнююКомпонентуАсинх(МакетКомпоненты);
		Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(МакетКомпоненты, ИмяКомпоненты, ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.НеИзолированно);
	КонецЕсли;
	
	Если Не Подключено Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту.";
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЭкземплярСервера() Экспорт
	Возврат mcp_ЭкземплярСервера;
КонецФункции

#КонецОбласти

