Процедура Пауза(Знач Интервал) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Интервал);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("Мсп_ПаузаВызовСервера.Пауза", Параметры);
	КонецЕсли;
		
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Интервал);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры
