#Область ПрограммныйИнтерфейс

// Регистрирует сценарии тестового модуля.
Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты.ДобавитьТест("СформироватьБазовыйСнимокФормыБезЗаголовка")
		.ДобавитьТест("СформироватьБазовыйСнимокФормыСЗаголовком");
КонецПроцедуры

// Проверяет базовый снимок формы без заголовка.
Процедура СформироватьБазовыйСнимокФормыБезЗаголовка() Экспорт
	Снимок = ВызватьФункциюМодуля("Мсп_ФормыКлиент", "СформироватьБазовыйСнимокФормы");

	ЮТест.ОжидаетЧто(Снимок)
		.Свойство("type").Равно("form")
		.Свойство("children").ИмеетДлину(0);
	ЮТест.ОжидаетЧто(Снимок.Свойство("title")).Равно(Ложь, "Заголовок не должен добавляться");
КонецПроцедуры

// Проверяет базовый снимок формы с заголовком.
Процедура СформироватьБазовыйСнимокФормыСЗаголовком() Экспорт
	Параметры = Новый Массив;
	Параметры.Добавить("Справочник");
	Снимок = ВызватьФункциюМодуля("Мсп_ФормыКлиент", "СформироватьБазовыйСнимокФормы", Параметры);

	ЮТест.ОжидаетЧто(Снимок)
		.Свойство("type").Равно("form")
		.Свойство("title").Равно("Справочник")
		.Свойство("children").ИмеетДлину(0);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызватьФункциюМодуля(ИмяМодуля, ИмяМетода, Параметры = Неопределено)
	Возврат ЮТМетодыСлужебный.ВызватьФункциюКонфигурации(ИмяМодуля, ИмяМетода, Параметры, Ложь);
КонецФункции

#КонецОбласти
